app/Controllers/Orders.php

    public function pollRefundResults():
        \CodeIgniter\HTTP\ResponseInterface
    {
        if (!session()->get('isLoggedIn')) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Unauthorized',
            ])->setStatusCode(401);
        }

        $userId = (int) (session()->get('userId') ?? 0);
        if ($userId <= 0) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Unauthorized',
            ])->setStatusCode(401);
        }

        $this->publishDueRefundResultNotifications($userId);

        $db = \Config\Database::connect();
        $rows = $db->table('notifications')
            ->select('id, message, created_at, related_id')
            ->where('user_id', $userId)
            ->where('type', 'refund_result')
            ->where('read', 0)
            ->orderBy('created_at', 'DESC')
            ->orderBy('id', 'DESC')
            ->limit(20)
            ->get()
            ->getResultArray();
---
SELECT `id`, `message`, `created_at`, `related_id`
FROM `notifications`
WHERE `user_id` = 4
AND `type` = 'refund_result'
AND `read` = 0
ORDER BY `created_at` DESC, `id` DESC
 LIMIT 20

    private function publishDueRefundResultNotifications(int $buyerId): void
    {
        if ($buyerId <= 0) {
            return;
        }

        try {
            $db = \Config\Database::connect();
            $this->ensureRefundRequestsTable($db);

            $rows = $db->table('refund_requests rr')
                ->select('rr.id, rr.order_id, rr.status, rr.refund_decision, rr.order_item_id, rr.product_id, oi.product_title')
                ->join('order_items oi', 'oi.order_item_id = rr.order_item_id', 'left')
                ->where('rr.buyer_id', $buyerId)
                ->where('rr.result_notified_at IS NULL', null, false)
                ->where('rr.created_at <= DATE_SUB(NOW(), INTERVAL 7 SECOND)', null, false)
                ->orderBy('rr.id', 'ASC')
                ->limit(50)
                ->get()
                ->getResultArray();
---
SELECT `rr`.`id`, `rr`.`order_id`, `rr`.`status`, `rr`.`refund_decision`, `rr`.`order_item_id`, `rr`.`product_id`, `oi`.`product_title`
FROM `refund_requests` `rr`
LEFT JOIN `order_items` `oi` ON `oi`.`order_item_id` = `rr`.`order_item_id`
WHERE `rr`.`buyer_id` = 4
AND rr.result_notified_at IS NULL
AND rr.created_at <= DATE_SUB(NOW(), INTERVAL 7 SECOND)
ORDER BY `rr`.`id` ASC
 LIMIT 50